# Задание 4.8
'''
Преобразовать IP-адрес в переменной ip в двоичный формат и вывести 
на стандартный поток вывода вывод столбцами, таким образом:

первой строкой должны идти десятичные значения байтов
второй строкой двоичные значения
Вывод должен быть упорядочен также, как в примере:

столбцами
ширина столбца 10 символов (в двоичном формате надо добавить два 
пробела между столбцами для разделения октетов между собой)

Пример вывода для адреса 10.1.1.1:

10        1         1         1
00001010  00000001  00000001  00000001

'''
def z8():
    ip = "192.168.3.1"
    sub = ip.split(".")
    result = '''
    {0:<10}  {1:<10}  {2:<10}  {3:<10}
    {0:<010b}  {1:<010b}  {2:<010b}  {3:<010b}
    '''.format(int(sub[0]), int(sub[1]), int(sub[2]), int(sub[3]))
    print(result)

z8()