#5.2a
'''
Всё, как в задании 5.2, но, если пользователь ввел адрес хоста, 
а не адрес сети, надо преобразовать адрес хоста в адрес сети и вывести адрес сети и маску, 
как в задании 5.2.

Пример адреса сети (все биты хостовой части равны нулю):

10.0.1.0/24
190.1.0.0/16
Пример адреса хоста:

10.0.1.1/24 - хост из сети 10.0.1.0/24
10.0.5.195/28 - хост из сети 10.0.5.192/28
Если пользователь ввел адрес 10.0.1.1/24, вывод должен быть таким:

Network:
10        0         1         0
00001010  00000000  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000
Проверить работу скрипта на разных комбинациях хост/маска, 
например: 10.0.5.195/28, 10.0.1.1/24

'''
network = input ("Введите IP-сеть в формате: 10.1.1.0/24: ")

ip, mask = network.split("/")
ip = ip.split(".")
mask = int(mask)

ip_bin = "{0:08b}{1:08b}{2:08b}{3:08b}".format(int(ip[0]), int(ip[1]), int(ip[2]), int(ip[3]))
print(ip_bin, "\n")

ip_network = ip_bin[:mask] + "0" * (32-mask)
print(ip_network, "\n")

bin_mask = "1" * mask + "0" * (32-mask)
print(bin_mask, "\n")

ip_template = """
Network:
{0:<10}{1:<10}{2:<10}{3:<10}
{0:08b}  {1:08b}  {2:08b}  {3:08b}
"""
oct1, oct2, oct3, oct4 = [int(bin_mask[0:8], 2), int(bin_mask[8:16], 2), int(bin_mask[16:24], 2), int(bin_mask[24:32], 2)]

mask_template = """
Mask:
/{0}
{1:<10}{2:<10}{3:<10}{4:<10}
{1:08b}  {2:08b}  {3:08b}  {4:08b}
"""

print(ip_template.format(int(ip_network[0:8], 2), int(ip_network[8:16], 2), int(ip_network[16:24], 2), int(ip_network[24:32], 2)))
print(mask_template.format(mask, oct1, oct2, oct3, oct4))